# OutdoorAirFlowStandard Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
HVACLoadType..::..OutdoorAirFlowStandard Property
HVACLoadType Class See Also
---
The outdoor airflow standard.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public OutdoorAirFlowStandard OutdoorAirFlowStandard { get; set; }
```

Visual Basic
---
```text
Public Property OutdoorAirFlowStandard As OutdoorAirFlowStandard
	Get
	Set
```

Visual C++
---
```text
public:
property OutdoorAirFlowStandard OutdoorAirFlowStandard {
	OutdoorAirFlowStandard get ();
	void set (OutdoorAirFlowStandard value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
HVACLoadType Class
Autodesk.Revit.DB.Analysis Namespace